app/Controllers/CvController.php

  public function index($id)
  {
    $data = [
      'user' => $this->userInformation->find($id),
      'contact' => $this->contactInformation->where('user_id', $id)->first(),
      'works' => $this->workExperience->where('user_id', $id)->findAll(),
---
SELECT *
FROM `contact_information`
WHERE `user_id` = '9'
 LIMIT 1
SELECT *
FROM `work_experience`
WHERE `user_id` = '9'

  public function update($id)
  {

    $data = [
      'user' => $this->userInformation->find($id),
      'contact' => $this->contactInformation->where('user_id', $id)->first(),
      'works' => $this->workExperience->where('user_id', $id)->findAll(),
---
SELECT *
FROM `contact_information`
WHERE `user_id` = '9'
 LIMIT 1
SELECT *
FROM `work_experience`
WHERE `user_id` = '9'