app/Controllers/HomeController.php

  public function index()
  {
    $data = [
      'users' => $this->userInformation->findAll(),
    ];
---
SELECT *
FROM `user_information`